{
    "name": "Stripe (Beta)",
    "archiveName": "robinthehood/stripe",
    "sourceDir": "src",
    "version": "auto",

    "shortDescription": "Ein modified-shop Modul das Zahlungen via Stripe ermöglicht.",
    "description": "⚠️ Achtung: Dieses Modul befindet sich in der Beta Test-Phase. Das Modul im Produktiv-System nur mit Bedacht einsetzen.<br><br><h3>💳 Revolutioniere deinen Online-Shop mit unserem kostenlosen Stripe Zahlungs Modul</h3>Bereit für den Sprung in die Zukunft des E-Commerce? Unser maßgeschneidertes Stripe-Zahlungsmodul für das modified Shop System macht es möglich. Mit diesem innovativen Tool kannst du deine Zahlungsmöglichkeiten erweitern und deinen Kunden ein nahtloses und sicheres Einkaufserlebnis bieten.<h3> 🚀 Steige in die Zukunft des E-Commerce ein</h3>Ermögliche deinen Kunden ein müheloses Einkaufserlebnis und steigere deine Umsätze mit unserem Stripe-Zahlungsmodul. Starte noch heute und beobachte, wie die Zahlungen reibungslos eingehen.<br><br>Bereit für die nächste Stufe deines Online-Shops? Lade dir jetzt das Stripe Modul und revolutioniere das Einkaufen für deine Kunden.<h3> Warum unser Stripe Zahlungs Modul?</h3><h4> ⭐️ Vielfältige Zahlungsoptionen</h4>Egal ob Kreditkarten, Apple Pay, Google Pay, Klarna, iDEAL und viele mehr – unser Modul unterstützt eine breite Palette von Stripe Zahlungsmethoden. Deine Kunden haben die Freiheit, bequem nach ihren Präferenzen zu bezahlen.<h4> ⭐️ Einfache Integration</h4>Die Integration in dein modified Shop System war noch nie so einfach. Mit wenigen Schritten kannst du Stripe nahtlos in deinen Shop einbinden, ohne aufwendige Anpassungen vornehmen zu müssen. Mit dem MMLC ist die Installation von unseres Stripe Moduls ein Kinderspiel. Darüber hinaus werden zukünftige Updates und Aktualisierungen des Moduls mühelos durchführbar sein.<h4> ⭐️ Sicherheit an erster Stelle</h4>Stripe ist bekannt für seine erstklassige Sicherheit. Deine Kunden können beruhigt einkaufen, da ihre Zahlungsinformationen in sicheren Händen sind.<h4> ⭐️ Sandbox Test-Modus</h4>Teste und optimiere dein Zahlungsmodul im Sandbox-Modus, ohne echtes Geld auszugeben. Dies ermöglicht dir, die Funktionalität deines Shops zu perfektionieren, bevor du live gehst.<h4> ⭐️ Benutzerfreundlichkeit</h4>Unser Stripe-Zahlungsmodul wurde mit Blick auf die Benutzerfreundlichkeit entwickelt. Sowohl für Shop-Besitzer als auch für Kunden ist die Bedienung ein Kinderspiel.<h4> ⭐️ OpenSource und Kostenlos</h4>Unser Stripe-Zahlungsmodul ist nicht nur kostenlos, sondern auch OpenSource auf GitHub. Das bedeutet, du hast volle Kontrolle über den Quellcode und kannst auf Unterstützung und Updates der OpenSource-Gemeinschaft zählen. Unser Modul überzeugt durch sauberen, verständlichen Code, bewährte Praktiken und ausführlichen dokumentierten Code. Dies alles sichert langfristige Wartbarkeit und fördert die Zusammenarbeit zur stetigen Weiterentwicklung des Moduls.",

    "installation": "",

    "developer": "RobinTheHood, grandeljay",
    "developerWebsite": "https://github.com/RobinTheHood/modified-stripe/graphs/contributors",
    "website": "https://github.com/RobinTheHood/modified-stripe",

    "category": "payment",
    "price": "free",

    "require": {
        "composer/autoload": "^1.3.0",
        "robinthehood/modified-std-module": ">=0.10.0"
    },

    "modifiedCompatibility": [
        "2.0.6.0",
        "2.0.7.0",
        "2.0.7.1",
        "2.0.7.2",
        "3.0.0"
    ],

    "autoload": {
        "psr-4": {
            "RobinTheHood\\Stripe\\": "src-mmlc",
            "Stripe\\": "src-mmlc/vendor/stripe/stripe-php/lib"
        }
    },

    "php": {
        "version": "^8.0.0"
    },

    "mmlc": {
        "version": "^1.21.0"
    }
}
